<?php

require_once 'function.php';

$location_id = array(641780 => 'Новосибирск', 641490 => 'Барабинск', 641510=>'Бердск', 641600=>'Искитим', 641630=>'Колывань', 641680=>'Краснообск', 641710=>'Куйбышев', 641760=>'Мошково', 641790=>'Обь', 641800=>'Ордынское', 641970=>'Черепаново');
$categories = array(
    'Транспорт'=> array(9 => 'Автомобили с пробегом', 109 => 'Новые автомобили', 14 => 'Мотоциклы и мототехника', 81 => 'Грузовики и спецтехника', 11 => 'Водный транспорт', 10 => 'Запчасти и аксессуары' ),
    'Недвижимость'=> array(24 => 'Квартиры', 23 => 'Комнаты', 25 => 'Дома, дачи, коттеджи', 26 => 'Земельные участки', 85 => 'Гаражи и машиноместа', 42 => 'Коммерческая недвижимость', 86 => 'Недвижимость за рубежом'),
    'Работа'=> array( 111 => 'Вакансии (поиск сотрудников)', 112 => 'Резюме (поиск работы)'),
    'Услуги'=> array( 114 => 'Предложения услуг', 115 => 'Запросы на услуги'),
    'Личные вещи'=> array( 27 => 'Одежда, обувь, аксессуары', 29 => 'Детская одежда и обувь', 30 => 'Товары для детей и игрушки', 28 => 'Часы и украшения', 88 => 'Красота и здоровье'),
    'Для дома и дачи'=> array( 21 => 'Бытовая техника', 20 => 'Мебель и интерьер', 87 => 'Посуда и товары для кухни', 82 => 'Продукты питания', 19 => 'Ремонт и строительство', 106 => 'Растения' ),
    'Бытовая электроника'=> array( 32 => 'Аудио и видео', 97 => 'Игры, приставки и программы', 31 => 'Настольные компьютеры', 98 => 'Ноутбуки', 99 => 'Оргтехника и расходники', 96 => 'Планшеты и электронные книги', 84 => 'Телефоны', 101 => 'Товары для компьютера', 105 => 'Фототехника' ),
    'Хобби и отдых'=> array( 33 => 'Билеты и путешествия', 34 => 'Велосипеды', 83 => 'Книги и журналы', 36 => 'Коллекционирование', 38 => 'Музыкальные инструменты', 102 => 'Охота и рыбалка', 39 => 'Спорт и отдых', 103 => 'Знакомства' ),
    'Животные'=> array( 89 => 'Собаки', 90 => 'Кошки', 91 => 'Птицы', 92 => 'Аквариум', 93 => 'Другие животные', 94 => 'Товары для животных' ),
    'Для бизнеса'=> array( 116 => 'Готовый бизнес', 40 => 'Оборудование для бизнеса')
);
// Переносим данные из $_COOKIES	
if (isset($_COOKIE['ads_db'])){
	$ads_db = unserialize($_COOKIE['ads_db']);
}
if (isset($_POST['main_form_submit'])) {
   
    $submit = $_POST['main_form_submit'];
    foreach ($_POST as $key => $value) {
        if ($key == 'main_form_submit') {
            continue;
        }
        $_POST[$key] = trim(htmlspecialchars($value));
    }
    switch ($submit) {
        case 'Подать объявление' :
            $_POST['date'] = date('d.m.Y H:i:s');
            $ads_db['db'][] = $_POST;
            break;
        case 'Сохранить' :
            $id = $_POST['hidden_id'];
            $_POST['date'] = $ads_db['db'][$id]['date'];
            $ads_db['db'][$id] = $_POST;
            break;
    }

    save_all($ads_db);
    header("Location: index.php");
    
    exit;
}


// Обработка команд на удаление
if (isset($_GET['delete'])) {
    $del = $_GET['delete'];
   delete_item($del, $ads_db);
    header("Location: index.php");
exit;
}	

// Вывод объявления
if (isset($_GET['show'])){
	$change_id=$_GET['show'];
	$changeAd=$ads_db['db'][$change_id];
		//unset($_SESSION['show']);
}
//print_r($_SESSION);
?>


<?php

require_once 'table.php';

// Вывод списка 
if (isset($ads_db['db'])){
    	foreach ($ads_db['db'] as $id => $item){
            
		echo '<p>'. $item['date'] .' | ' . '<a href="index.php?show=' . $id . '">' . $item['title'] . '</a>' .' | ' . number_format($item['price'], 2, '.', '') . ' руб.' . ' | ' . $item['firstname'] .' | ' . '<a href="index.php?delete=' . $id . '">Удалить</a>' . "</p>\n\r";
             
	}
}

?>

